# FilterStringRuleEvaluator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringRuleEvaluator Class
Members See Also
---
Base for all classes that compare string values from Revit to a user-supplied filter value
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterStringRuleEvaluator : IDisposable
```

Visual Basic
---
```text
Public Class FilterStringRuleEvaluator _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FilterStringRuleEvaluator : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterStringRuleEvaluator Autodesk.Revit.DB..::..FilterStringBeginsWith Autodesk.Revit.DB..::..FilterStringContains Autodesk.Revit.DB..::..FilterStringEndsWith Autodesk.Revit.DB..::..FilterStringEquals Autodesk.Revit.DB..::..FilterStringGreater Autodesk.Revit.DB..::..FilterStringGreaterOrEqual Autodesk.Revit.DB..::..FilterStringLess Autodesk.Revit.DB..::..FilterStringLessOrEqual
# See Also
FilterStringRuleEvaluator Members
Autodesk.Revit.DB Namespace